# Creating Dummy Dataset of bank for Personal Loan product

## Attributes:

- Date_of_dis => Date of loan disbursement
- Customer_id
- First_name
- Last_name
- Gender => (Male, Female)
- Email
- Phone
- Age
- Occupation => Customers occupation
- Income
- Marital_status => (Married, Single, Divorced, Widowed, Seperated)
- Principle_Amount
- Interest_rate
- Processing_fee
- Tenure => (12, 24, 36, 48, 60)months
- EMI
- First_duedate
- Tenure_rem => Tenure Remaining
- Principle_amt_rem => Principle amount remaining
- Last_duedate
- Last_payrecvd
- Next_duedate
- Loan_status => (Active, Collection, Sold, Paidoff)
- Loan_purpose => ('Bill Payments', 'Emergency Expenses', 'Home Repairs', 'Refinance', 'Medical Expense', 'Personal Expenses')

In [140]:
import pandas as pd
import numpy as np

In [141]:
# Creating 1lac rows od 'Date of credit'

date_range = pd.date_range(start='2018-01-01', end= '2019-12-31', freq='D')
date = list(pd.Series(date_range))
Date_of_cr = np.random.choice(date, 100000)
df = pd.DataFrame(Date_of_cr, columns=['Date_of_cr'])
df['Date_of_cr'] = sorted(df['Date_of_cr'])
df.head()

  Date_of_cr
0 2018-01-01
1 2018-01-01
2 2018-01-01
3 2018-01-01
4 2018-01-01

In [142]:
df.shape

(100000, 1)

In [143]:
# Creating Customer Id data
import random

df['Customer_id'] = sorted(random.sample(range(1000000, 9999999), len(df['Date_of_cr']))) 
df.head()

  Date_of_cr  Customer_id
0 2018-01-01      1000040
1 2018-01-01      1000055
2 2018-01-01      1000322
3 2018-01-01      1000371
4 2018-01-01      1000529

In [144]:
lastname = pd.read_csv('/content/drive/My Drive/Colab Notebooks/iNeuron Project/Indian-Last-Names.csv')


# removing all missing data and non alpha data
l_name=[]

for x in lastname['Last_names']:
  if type(x) == str:
    l_name.append(x)

# taking only the first word of the name
last_name = []

for x in l_name:
  last_name.append(x.split()[0])

In [145]:
len(last_name)

564

In [146]:
# Creating 1 lac names (50k male & 50k female names)

malename = pd.read_csv('/content/drive/My Drive/Colab Notebooks/iNeuron Project/Indian-Male-Names.csv')
malename = malename.drop(['race'], axis=1)

femalename = pd.read_csv('/content/drive/My Drive/Colab Notebooks/iNeuron Project/Indian-Female-Names.csv')
femalename = femalename.drop(['race'], axis=1)

In [147]:
femalename.tail()

                            name gender
15377                 saroj devi      f
15378              naina @ geeta      f
15379  manju d/0 baboo lal jatav      f
15380                    shivani      f
15381                      nayna      f

In [148]:
malename = malename.dropna(axis=0)
femalename = femalename.dropna(axis=0)

In [149]:
print(malename.isna().sum())
print(femalename.isna().sum())

name      0
gender    0
dtype: int64
name      0
gender    0
dtype: int64

In [150]:
malename['gender'] = malename['gender'].replace('m', 'Male')
femalename['gender'] = femalename['gender'].replace('f', 'Female')

In [151]:
# removing all except for english
import re

malename['name'] = [re.sub('[^A-Za-z]+', '', x) for x in malename['name']]
femalename['name'] = [re.sub('[^A-Za-z]+', '', x) for x in femalename['name']]
femalename.sort_values(by = 'name')

             name  gender
5568               Female
14757              Female
13691              Female
9861               Female
14791              Female
...           ...     ...
8748       zeenat  Female
5760    zenabkhan  Female
12993   zhinidevi  Female
2313   zinakumari  Female
9694         zoya  Female

[15351 rows x 2 columns]

In [152]:
mllist = [malename.name.unique()]
mllist = np.sort(mllist)
mllist[0][0]

''

In [153]:
malename['name'] = malename['name'].replace('', np.nan)
femalename['name'] = femalename['name'].replace('', np.nan)

In [154]:
print(malename.isna().sum())
print(femalename.isna().sum())

name      45
gender     0
dtype: int64
name      70
gender     0
dtype: int64

In [155]:
malename = malename.dropna(axis=0)
femalename = femalename.dropna(axis=0)

In [156]:
print(malename.isna().sum())
print(femalename.isna().sum())

name      0
gender    0
dtype: int64
name      0
gender    0
dtype: int64

In [157]:
print(malename.shape)
print(femalename.shape)

(14776, 2)
(15281, 2)

In [158]:
femalename.head().sort_values(by= 'name')

            name  gender
3          divya  Female
1           isha  Female
4          mansi  Female
0        shivani  Female
2  smtshyanidevi  Female

In [159]:
malename.to_csv('malename.csv')
femalename.to_csv('femalename.csv')

In [160]:
malename50k = np.random.choice(malename['name'], 50000)
femalename50k = np.random.choice(femalename['name'], 50000)
malegender50k = np.random.choice(malename['gender'], 50000)
femalegender50k = np.random.choice(femalename['gender'], 50000)

In [161]:
Mnamedata = pd.DataFrame(list(zip(malename50k, malegender50k)), columns=['First_name', 'Gender'])
Fnamedata = pd.DataFrame(list(zip(femalename50k, femalegender50k)), columns=['First_name', 'Gender'])

In [162]:
Mnamedata.head()

            First_name Gender
0              pradeep   Male
1                anish   Male
2          kamalkishor   Male
3               dinesh   Male
4  madankumarchaudhari   Male

In [163]:
bothnamegenderdata = pd.concat([Mnamedata, Fnamedata], axis=0, ignore_index=True)   
bothnamegenderdata.shape

(100000, 2)

In [164]:
# shuffle rows of dataframe

df1 = bothnamegenderdata.sort_values(by='First_name')

In [165]:
df1.head(10)

      First_name Gender
1287       aabid   Male
14902      aabid   Male
1857       aabid   Male
37552      aabid   Male
23572      aabid   Male
2844       aabid   Male
2999       aabid   Male
29822      aabid   Male
35013      aabid   Male
37066      aabid   Male

In [166]:
df = pd.concat([df, df1], join='inner', axis=1)

In [167]:
df.head()

  Date_of_cr  Customer_id           First_name Gender
0 2018-01-01      1000040              pradeep   Male
1 2018-01-01      1000055                anish   Male
2 2018-01-01      1000322          kamalkishor   Male
3 2018-01-01      1000371               dinesh   Male
4 2018-01-01      1000529  madankumarchaudhari   Male

In [168]:
df['Last_name'] = np.random.choice(last_name, 100000)

In [169]:
df['First_name'] = df.First_name.str.capitalize()
df['Last_name'] = df.Last_name.str.capitalize()

In [170]:
df = df[['Date_of_cr',	'Customer_id',	'First_name', 'Last_name', 'Gender']]
df.head()

  Date_of_cr  Customer_id           First_name Last_name Gender
0 2018-01-01      1000040              Pradeep      Basu   Male
1 2018-01-01      1000055                Anish    Kalita   Male
2 2018-01-01      1000322          Kamalkishor    Biswas   Male
3 2018-01-01      1000371               Dinesh   Shanker   Male
4 2018-01-01      1000529  Madankumarchaudhari    Bakshi   Male

In [171]:
# Creating Email
df['Email'] = df.First_name.str.lower() + '.' + df.Last_name.str.lower() + '@dummyemail.com'

In [172]:
# Creating Phone #

df['Phone'] = random.sample(range(7000000000, 9999999999), 100000)

In [173]:
# Creating Age

df['Age'] = np.random.choice(range(25, 55), 100000)

In [174]:
# Creating Occupation

occupation = ['Engineer', 'Teacher', 'Architect', 'Consultant', 'Scientist', 'Software Developer',
              'Lawyer', 'Psychologist', 'Veterinarian', 'Civil Engineer', 'Surveyor', 'Secretary',
              'Broker', 'Train_driver', 'Physician', 'Furniture Designer', 'Aviator', 'Estate agent',
              'Domestic worker', 'Chef', 'Hotel Manager', 'Financial Analyst', 'Political scientist',
              'Author', 'Biomedical Engineer', 'Official', 'Mathematician', 'Loan Officer', 'Machinist',
              'Musician', 'Businessperson', 'Civil servant', 'Tailor', 'Politician', 'Designer', 'Industrial Engineer',
              'Physiotherapist', 'Drafter', 'Rocket scientist', 'Graphic Designer', 'Health professional',
              'Petroleum Engineer', 'Flight attendant', 'Historian', 'Mechanical engineer', 'Flight engineer',
              'Professor', 'Army officer', 'Makeup Artist', 'School counselor', 'Computer operator', 'Govt.Service',
              'Service', 'Self Employed']

df['Occupation'] = np.random.choice(occupation, 100000)

In [175]:
# Creating income column
df['Income'] = np.random.randint(300000, 3000000, 100000)

In [176]:
# Creating maritak status

marital_status = ['Married', 'Divorced', 'Single', 'Widowed', 'Separated']

df['Marital_status'] = np.random.choice(marital_status, 100000, p=[0.6, 0.1, 0.1, 0.1, 0.1])

In [177]:
# Loan Purpose 

purpose = ['Bill Payments', 'Emergency Expenses', 'Home Repairs', 'Refinance', 'Medical Expense', 'Personal Expenses']

df['Loan_purpose'] = np.random.choice(purpose, 100000)

In [178]:
# Creating Principle Amount

df['Principle_Amount'] = np.random.randint(300, 3000, 100000)
df['Principle_Amount'] = df['Principle_Amount']*1000

In [179]:
# Creating Interest rate

df['Interest_rate'] = np.random.uniform(14, 24, 100000)
df['Interest_rate'] = df['Interest_rate'].round(1)

In [180]:
# Processing fee is 0.35% of the principle amount

df['Processing_fee'] = df['Principle_Amount']*0.35/100

In [181]:
# Tenure
tenure = [12, 24, 36, 48, 60]
df['Tenure'] = np.random.choice(tenure, 100000)

In [182]:
# Creating EMI based on principle amount, interest rate & tenure

df['EMI'] = (((df['Tenure']/12)*((df['Interest_rate']*df['Principle_Amount'])/100))+df['Principle_Amount'])/df['Tenure']
df['EMI'] = df['EMI'].round(2)

In [183]:
# creating due date
from dateutil.relativedelta import relativedelta

date = [2, 10, 17, 24]
dates = np.random.choice(date, 100000)
year = []
month= []


for x in df['Date_of_cr']:
  y = x.year
  year.append(y)
  m = x.month 
  month.append(m)

duedate = pd.DataFrame(list(zip(year, month, dates)), columns=['year', 'month', 'day'])

df['First_duedate'] = pd.to_datetime(duedate[['year', 'month', 'day']])

First_duedate = []
for index, row in df.iterrows():
  ld = row['First_duedate'] + relativedelta(months=+ 1)
  First_duedate.append(ld)


df['First_duedate'] = First_duedate

In [184]:
df.shape

(100000, 18)

In [185]:
# Finding last Due date
from datetime import date
from dateutil.relativedelta import relativedelta

last_duedate = []
for index, row in df.iterrows():
  ld = row['First_duedate'] + relativedelta(months=+row['Tenure'])
  last_duedate.append(ld)

df['Last_duedate'] = last_duedate

In [186]:
# Last Payment Received
from datetime import datetime
today = datetime.today().date()

last_payrecvd = []

for index, row in df.iterrows():
  months_passed = (today.year - row['First_duedate'].year)*12 + (today.month - row['First_duedate'].month)
  if months_passed <= row['Tenure']:
    y = str(random.choices(range(months_passed + 1), weights=([0]*(months_passed - 2) + [30, 30, 40]))).strip('[]')
    lpd = row['First_duedate'] + relativedelta(months=+ int(y))
    last_payrecvd.append(lpd)
  else:
    y = str(random.choices(range(row['Tenure'] + 1), weights=([0]*(row['Tenure'] - 2) + [30, 30, 40]))).strip('[]')
    lpd = row['First_duedate'] + relativedelta(months=+ int(y))
    last_payrecvd.append(lpd)
    

df['Last_payrecvd'] = last_payrecvd

In [187]:
# Tenure remaining
import random
from datetime import datetime

tenure_rem = []
for index, row in df.iterrows():
  months_passed = (row['Last_payrecvd'].year - row['First_duedate'].year)*12 + (row['Last_payrecvd'].month - row['First_duedate'].month)
  tr = row['Tenure'] - months_passed
  if tr <= 0:
    tr = 0
    tenure_rem.append(tr)
  else:
    tenure_rem.append(tr)

df['Tenure_rem'] = tenure_rem

In [188]:
# Next Duedate
from datetime import datetime

next_duedate = []

for index, row in df.iterrows():
  nd = row['Last_payrecvd'] + relativedelta(months=+1)
  if nd <= row['Last_duedate']:
    next_duedate.append(nd.date())
  else:
    nd = pd.datetime(1999, 1, 1)
    next_duedate.append(nd)

df['Next_duedate'] = next_duedate

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:11: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime instead.
  # This is added back by InteractiveShellApp.init_path()

In [189]:
# Principle amount remaining
Principle_amt_rem = []

for index, row in df.iterrows():
  principleamtrem = ((row['Tenure'] - row['Tenure_rem'])*(row['EMI'])*50/100)
  if row['Tenure_rem'] == 0:
    principleamtrem = 0
    Principle_amt_rem.append(round(principleamtrem, 2))
  else:
    Principle_amt_rem.append(round(principleamtrem, 2))

df['Principle_amt_rem'] = Principle_amt_rem

In [190]:
# Loan Status
from datetime import datetime

loanstatus = []

for index, row in df.iterrows():
  if row['Next_duedate'] == pd.datetime(1999, 1, 1):
    loanstatus.append('Paidoff')
  elif row['Next_duedate'] >= datetime.now():
    loanstatus.append('Active')
  elif row['Next_duedate'] < datetime.now():
    if row['Next_duedate'] > (datetime.now() - relativedelta(months=+3)) and row['Next_duedate'] < datetime.now():
      loanstatus.append('Collection')
    elif row['Next_duedate'] < (datetime.now() - relativedelta(months=+3)):
      loanstatus.append('Sold')

  

df['Loan_status'] = loanstatus

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:7: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime instead.
  import sys

In [191]:
df['Loan_status'].value_counts()

Active        45198
Collection    29752
Sold          13884
Paidoff       11166
Name: Loan_status, dtype: int64

In [192]:
# late payments

late_payment = []

for index, row in df.iterrows():
  if row['Loan_status'] == 'Collection':
    lp = row['EMI']*5/100
    late_payment.append(lp)
  else:
    lp = 0
    late_payment.append(lp)

df['Late_payment'] = late_payment

In [193]:
# foreclosure amount

foreclosureamt = []

for index, row in df.iterrows():
  if row['Principle_amt_rem'] != 0:
    fa = (row['Principle_amt_rem']*3/100) + (row['Principle_amt_rem']) + ((row['Principle_amt_rem']*3/100)*18/100)
    foreclosureamt.append(round(fa, 2))
  else:
    fa = 0
    foreclosureamt.append(round(fa, 2))


df['Foreclosure_amt'] = foreclosureamt

In [194]:
cols = ['Date_of_cr', 'Customer_id', 'First_name', 'Last_name', 'Gender',
        'Email', 'Phone', 'Age', 'Occupation', 'Income', 'Marital_status', 'Loan_purpose',
        'Principle_Amount', 'Interest_rate', 'Processing_fee', 'Tenure', 'Tenure_rem', 
        'EMI', 'First_duedate', 'Last_duedate', 'Last_payrecvd', 'Next_duedate', 
        'Loan_status', 'Principle_amt_rem', 'Late_payment', 'Foreclosure_amt' ]

df = df[cols]

In [195]:
df.head(10)

  Date_of_cr  Customer_id  ... Late_payment Foreclosure_amt
0 2018-01-01      1000040  ...          0.0      1117462.44
1 2018-01-01      1000055  ...          0.0      1575481.01
2 2018-01-01      1000322  ...          0.0            0.00
3 2018-01-01      1000371  ...          0.0       385541.03
4 2018-01-01      1000529  ...          0.0            0.00
5 2018-01-01      1000539  ...          0.0       500958.46
6 2018-01-01      1000635  ...          0.0      1243494.69
7 2018-01-01      1000671  ...          0.0       789651.28
8 2018-01-01      1000874  ...          0.0      1060100.62
9 2018-01-01      1000880  ...          0.0      1098493.13

[10 rows x 26 columns]

In [196]:
df.to_csv('Personal_loan_dataset.csv')